{"config": [{"config": {"kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "filters": 64, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"units": 10, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential"}